# Data processing: Pandas

* Python library for data manipulation and analysis
* high-performance and efficient
* easy to use
* to handle structured data
* perform operations like: filtering, grouping, aggregation
* data visualization

Often used in fields as:
* data science
* machine learning
* data analysis




---------------------------------------------------------

First, **install** pandas using:
    pip install pandas

**Import pandas**

In [1]:
import pandas as pd  #pd commonly used abbreviation

## Pandas Series

* A one-dimensional array-like object
* Can hold data of any type (integer, float, string, etc.)
* Labelled data, each element has an index. 
* Can be created from lists, arrays, dictionaries, and existing Series objects
* Building block for the Pandas DataFrame
* Like a column in a spreadsheet, a single column of a database table
* The length of a Series cannot be changed (but values can be changed and columns can be inserted into DataFrames)


--> The vast majority of Pandas methods produce new objects, leaving the input data untouched. 
* Immutability is favored where sensible

### Creating a Pandas Series from a list

In [2]:
data = ["Mickey", "Minnie", "Pluto", "Donald Duck"]
series_from_list = pd.Series(data)
series_from_list

0         Mickey
1         Minnie
2          Pluto
3    Donald Duck
dtype: object

If no index labels are specified, they are labeled with their index numbers (starting from 0)

### Creating a Pandas Series from a dictionary

In [3]:
data = {"a": 1, "b": 2, "c": 3, "d":4}
series_from_dict = pd.Series(data)
series_from_dict

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
my_series = pd.Series({'London':10, 'Tripoli':100, 'Cairo':10})

* Index labels: 'London', 'Tripoli', 'Cairo'
* Values of the Series: 10, 100, 10

In [5]:
# Displaying the Series
my_series

London      10
Tripoli    100
Cairo       10
dtype: int64

### Creating a Series with a custom index

In [6]:
data = ["Pooh", "Winnie", "Kanga", "Roo"]
index = ["Participant1", "Participant2", "Participant3", "Participant4"]
series_custom_index = pd.Series(data, index=index)
print(series_custom_index)

Participant1      Pooh
Participant2    Winnie
Participant3     Kanga
Participant4       Roo
dtype: object

In [7]:
#Creating a Series using only the data from a dict with the keys "London" and "Cairo"
lc_series = pd.Series(my_series, index=["London", "Cairo"])
lc_series

London    10
Cairo     10
dtype: int64

### Accessing and manipulating data using the index label

In [8]:
# Accessing a specific element in the Series using the index label
my_series['Tripoli']

100

In [11]:
print(series_from_list[0])
print(series_from_dict["b"])

Mickey
2

In [12]:
# Filtering elements based on a condition
my_series[my_series > 10]

Tripoli    100
dtype: int64

### Attributes
A Series object has several attributes: index, values, dtype, shape, ndim, size, name...

In [27]:
data = {"a": "Mickey", "b": "Donald", "c": "Joris", "d":"Henk"}
series_from_dict = pd.Series(data)
series_from_dict

a    Mickey
b    Donald
c     Joris
d      Henk
dtype: object

Checkout the [API reference](https://pandas.pydata.org/docs/reference/series.html#constructor) for more functionality.

## Pandas DataFrame

* Two-dimensional labeled data structure
* Like a spreadsheet or table
* Three main components
    - the data: stored in rows and columns
    - the rows: labeled by an index
    - the columns: labeled and contain the actual data
* Flexible indexing
* Acces to rows, columns or individual elements based on labels or integer positions
* Size can be changed

### Creating a DataFrame from a dictionary

In [37]:
# Sample data (dict) for DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['London', 'New York', 'Paris', 'Tokyo', 'Sydney'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

In [38]:
# Creating a DataFrame
df = pd.DataFrame(data)

# Displaying the DataFrame
df

      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
4     Emma   32    Sydney   65000

### Creating a DataFrame from a list of lists

In [35]:
data2 = [['John', 25, 'New York'],
        ['Alice', 30, 'Los Angeles'],
        ['Bob', 35, 'Chicago']]
columns = ['Name', 'Age', 'City']
df2 = pd.DataFrame(data2, columns=columns)
df2

    Name  Age         City
0   John   25     New York
1  Alice   30  Los Angeles
2    Bob   35      Chicago

### Indexing

##### Accessing a column

In [39]:
# Accessing a column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
4       Emma
Name: Name, dtype: object

##### Accesing a row by label

In [40]:
 # Accessing a row by label
print(df.loc[0])

Name       Alice
Age           25
City      London
Salary     60000
Name: 0, dtype: object

##### Accessing a row by integer position

In [41]:
 # Accessing a row by integer position
print(df.iloc[0])

Name       Alice
Age           25
City      London
Salary     60000
Name: 0, dtype: object

##### Accessing an individual element

In [42]:
# Accessing an individual element
print(df.at[3, 'Name'])

David

### Slicing

##### Index labels: loc

In [43]:
# Using index labels for rows and columns: loc

df.loc[1:3, 'Name':'City']

      Name  Age      City
1      Bob   30  New York
2  Charlie   35     Paris
3    David   28     Tokyo

##### Integer positions: iloc

In [44]:
# Using integer positions for rows and columns: iloc
df.iloc[1:3, 0:3]

      Name  Age      City
1      Bob   30  New York
2  Charlie   35     Paris

***Beware! Labels vs indexing!***

In [45]:
print("df")
print(df)
print("Labels")
print(df.loc[1:3]) #labels
print("Integer positions")
print(df.iloc[1:3]) #integer positions

df
      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
4     Emma   32    Sydney   65000
Labels
      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
Integer positions
      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000

### Column operations

##### Adding a new column

In [46]:
# Adding a new column
df['Experience'] = [3, 5, 7, 4, 6]
df

      Name  Age      City  Salary  Experience
0    Alice   25    London   60000           3
1      Bob   30  New York   75000           5
2  Charlie   35     Paris   80000           7
3    David   28     Tokyo   70000           4
4     Emma   32    Sydney   65000           6

##### Boolean indexing

In [47]:
# Filtering rows based on a condition (boolean indexing)
high_salary_employees = df[df['Salary'] > 70000]
print(high_salary_employees)

      Name  Age      City  Salary  Experience
1      Bob   30  New York   75000           5
2  Charlie   35     Paris   80000           7

##### Sorting by column

In [48]:
# Sorting DataFrame by a column
sorted_df = df.sort_values(by='Age', ascending=False)
print(sorted_df)

      Name  Age      City  Salary  Experience
2  Charlie   35     Paris   80000           7
4     Emma   32    Sydney   65000           6
1      Bob   30  New York   75000           5
3    David   28     Tokyo   70000           4
0    Alice   25    London   60000           3

### Missing Data Handling

In [49]:
#Add a row with missing data
import numpy as np
new_row = {"Name": "Mo", "Age": 23, "City": "Leuven", "Salary": np.nan, "Experience": 1}
df.loc[len(df)] = new_row
df

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6
5       Mo   23    Leuven      NaN           1

In [51]:
# Dropping rows with missing values
df.dropna()
df

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6
5       Mo   23    Leuven      NaN           1

In [52]:
# Dropping rows with missing values
k = df.dropna()
k

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6

In [53]:
# Filling missing values with a specified value
p = df.fillna(0)
p

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6
5       Mo   23    Leuven      0.0           1

### Grouping and aggregation

In [54]:
# Grouping by a column and calculating mean
avg_age_by_city = df.groupby('City')['Age'].mean()
avg_age_by_city

City
Leuven      23.0
London      25.0
New York    30.0
Paris       35.0
Sydney      32.0
Tokyo       28.0
Name: Age, dtype: float64

### Attributes and underlying data
A DataFrame object has several attributes: index, columns, values, dtypes, axes, ndim, size,shape, empty, head, tail...

In [65]:
#Let's play around
df.size # rows * columns

30

Use ***info()*** method to display information about the DataFrame

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   City        6 non-null      object
 3   Salary      5 non-null      float64
 4   Experience  6 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 288.0+ bytes

The ***describe()*** method generates summary statistics (count, mean, std, min, 25%, 50%, 75%, max) for numeric columns in the DataFrame

In [67]:
df.describe()  #p

             Age       Salary  Experience
count   6.000000      5.00000    6.000000
mean   28.833333  70000.00000    4.333333
std     4.445972   7905.69415    2.160247
min    23.000000  60000.00000    1.000000
25%    25.750000  65000.00000    3.250000
50%    29.000000  70000.00000    4.500000
75%    31.500000  75000.00000    5.750000
max    35.000000  80000.00000    7.000000

### Operations

In [68]:
# Sample data
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [5, 4, 3, 2, 1],
    'C': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)
df

   A  B   C
0  1  5  10
1  2  4  20
2  3  3  30
3  4  2  40
4  5  1  50

#### Arithmetic operations

In [69]:
# Addition
print(df['A'] + df['B'])  # Adds columns A and B element-wise

0    6
1    6
2    6
3    6
4    6
dtype: int64

In [70]:
# Subtraction
print(df['C'] - df['B'])  # Subtracts column B from column C element-wise

0     5
1    16
2    27
3    38
4    49
dtype: int64

In [71]:
df

   A  B   C
0  1  5  10
1  2  4  20
2  3  3  30
3  4  2  40
4  5  1  50

In [72]:
# Multiplication
print(df['A'] * df['C'])  # Multiplies columns A and C element-wise

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [73]:
# Division
print(df['C'] / df['A'])  # Divides column C by column A element-wise

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

#### Statistical aggregations

In [74]:
# Mean
print(df.mean())  # Calculates the mean of each column

A     3.0
B     3.0
C    30.0
dtype: float64

In [75]:
# Median
print(df.median())  # Calculates the median of each column

A     3.0
B     3.0
C    30.0
dtype: float64

#### Merging and joining DataFrames

In [80]:
# Concatenating along columns
df_concat = pd.concat([df, df], axis=1)  # Concatenates the DataFrame with itself along columns
df_concat

   A  B   C  A  B   C
0  1  5  10  1  5  10
1  2  4  20  2  4  20
2  3  3  30  3  3  30
3  4  2  40  4  2  40
4  5  1  50  5  1  50

In [81]:
# Concatenating along rows
df_concat = pd.concat([df, df], axis=0)  # Concatenates the DataFrame with itself along rows
df_concat

   A  B   C
0  1  5  10
1  2  4  20
2  3  3  30
3  4  2  40
4  5  1  50
0  1  5  10
1  2  4  20
2  3  3  30
3  4  2  40
4  5  1  50

### Creating a dataframe from data in a CSV

In [85]:
df = pd.read_csv('../games.csv')
print(df)

      Unnamed: 0                                    Title  Release Date  \
0              0                               Elden Ring  Feb 25, 2022
1              1                                    Hades  Dec 10, 2019
2              2  The Legend of Zelda: Breath of the Wild  Mar 03, 2017
3              3                                Undertale  Sep 15, 2015
4              4                            Hollow Knight  Feb 24, 2017
...          ...                                      ...           ...
1507        1507             Back to the Future: The Game  Dec 22, 2010
1508        1508                        Team Sonic Racing  May 21, 2019
1509        1509                           Dragon's Dogma  May 22, 2012
1510        1510                          Baldur's Gate 3  Oct 06, 2020
1511        1511                 The LEGO Movie Videogame  Feb 04, 2014

                                                   Team  Rating Times Listed  \
0        ['Bandai Namco Entertainment', 'FromSoftware']     4.5         3.9K
1                                  ['Supergiant Games']     4.3         2.9K
2     ['Nintendo', 'Nintendo EPD Production Group No...     4.4         4.3K
3                                    ['tobyfox', '8-4']     4.2         3.5K
4                                       ['Team Cherry']     4.4           3K
...                                                 ...     ...          ...
1507                                 ['Telltale Games']     3.2           94
1508                           ['Sumo Digital', 'Sega']     2.9          264
1509                                         ['Capcom']     3.7          210
1510                                 ['Larian Studios']     4.1          165
1511                          ['WB Games', 'TT Fusion']     2.8          184

     Number of Reviews                                             Genres  \
0                 3.9K                               ['Adventure', 'RPG']
1                 2.9K           ['Adventure', 'Brawler', 'Indie', 'RPG']
2                 4.3K                               ['Adventure', 'RPG']
3                 3.5K  ['Adventure', 'Indie', 'RPG', 'Turn Based Stra...
4                   3K                 ['Adventure', 'Indie', 'Platform']
...                ...                                                ...
1507                94                   ['Adventure', 'Point-and-Click']
1508               264                               ['Arcade', 'Racing']
1509               210                                 ['Brawler', 'RPG']
1510               165  ['Adventure', 'RPG', 'Strategy', 'Tactical', '...
1511               184                            ['Adventure', 'Puzzle']

                                                Summary  \
0     Elden Ring is a fantasy, action and open world...
1     A rogue-lite hack and slash dungeon crawler in...
2     The Legend of Zelda: Breath of the Wild is the...
3     A small child falls into the Underground, wher...
4     A 2D metroidvania with an emphasis on close co...
...                                                 ...
1507  Back to the Future: The Game is one of Telltal...
1508  Team Sonic Racing combines the best elements o...
1509  Set in a huge open world, Dragons Dogma: Dark...
1510  An ancient evil has returned to Baldur's Gate,...
1511  Join Emmet and an unlikely group of resistance...

                                                Reviews Plays Playing  \
0     ["The first playthrough of elden ring is one o...   17K    3.8K
1     ['convinced this is a roguelike for people who...   21K    3.2K
2     ['This game is the game (that is not CS:GO) th...   30K    2.5K
3     ['soundtrack is tied for #1 with nier automata...   28K     679
4     ["this games worldbuilding is incredible, with...   21K    2.4K
...                                                 ...   ...     ...
1507  ['Very enjoyable game. The story adds onto the...   763       5
1508  ['jogo morto mas bom', 'not my cup of tea', "C...  1.5K      49
1509  ['Underrated.', 'A grandes rasgos, es como un ...  1.1K      45
1510  ['Bu tre bu oyunla girmeye almak hatayd s...   269      79
1511  ['Legal', 'Pretty Average Lego Game But It Was...  1.7K      11

     Backlogs Wishlist
0        4.6K     4.8K
1        6.3K     3.6K
2          5K     2.6K
3        4.9K     1.8K
4        8.3K     2.3K
...       ...      ...
1507      223       67
1508      413      107
1509      487      206
1510      388      602
1511      239       73

[1512 rows x 14 columns]